results/ASPLOS/WILDFIRE/YCSB-ROCKSDB-CORUN-200sec/50M-KEYS/8/batchsize-128/ycsbwkldb/CII.out
Setting g_min_fd 3 
Setting g_min_fd 3 
RocksDB:    version 5.4
Date:       Sun Mar  3 22:23:03 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwkldb    :       5.064 micros/op 197456 ops/sec; ( reads:4715645 writes:248354 total:50000000 found:4715645)
	Command being timed: "/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=200 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwkldb --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 413.63
	System time (seconds): 434.43
	Percent of CPU this job got: 414%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 3:24.70
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 2061988
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 74
	Minor (reclaiming a frame) page faults: 5250733
	Voluntary context switches: 7369207
	Involuntary context switches: 2871
	Swaps: 0
	File system inputs: 156589264
	File system outputs: 188223656
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[86718.745487] sh (263164): drop_caches: 3
[86718.837731] sh (263171): drop_caches: 3
[86753.057112] write_proc_unbounded: Value of write = 1
[86753.057123] write_proc_2mb_limit: Value of write = 1
[86753.057128] write_proc_bitmap_shift: Value of write = 38
[86753.063403] write_proc_unbounded: Value of write = 1
[86753.063412] write_proc_2mb_limit: Value of write = 1
[86753.063417] write_proc_bitmap_shift: Value of write = 38
[86753.859652] write_proc_unbounded: Value of write = 0
[86753.859666] write_proc_2mb_limit: Value of write = 0
[86753.860183] write_proc_unbounded: Value of write = 0
[86753.860194] write_proc_2mb_limit: Value of write = 0
[86753.860242] write_proc_unbounded: Value of write = 0
[86753.860248] write_proc_2mb_limit: Value of write = 0
[86753.860518] write_proc_unbounded: Value of write = 0
[86753.860535] write_proc_2mb_limit: Value of write = 0
[86753.860647] write_proc_unbounded: Value of write = 0
[86753.860665] write_proc_2mb_limit: Value of write = 0
[86753.860748] write_proc_unbounded: Value of write = 0
[86753.860756] write_proc_2mb_limit: Value of write = 0
[86753.861001] write_proc_unbounded: Value of write = 0
[86753.861009] write_proc_2mb_limit: Value of write = 0
[86753.861136] write_proc_unbounded: Value of write = 0
[86753.861146] write_proc_2mb_limit: Value of write = 0
[86753.861331] write_proc_unbounded: Value of write = 0
[86753.861339] write_proc_2mb_limit: Value of write = 0
[86753.861810] write_proc_unbounded: Value of write = 0
[86753.861822] write_proc_2mb_limit: Value of write = 0
[86753.861879] write_proc_unbounded: Value of write = 0
[86753.861886] write_proc_2mb_limit: Value of write = 0
[86753.862451] write_proc_unbounded: Value of write = 0
[86753.862463] write_proc_2mb_limit: Value of write = 0
[86753.862501] write_proc_unbounded: Value of write = 0
[86753.862509] write_proc_2mb_limit: Value of write = 0
[86753.862520] write_proc_unbounded: Value of write = 0
[86753.862530] write_proc_2mb_limit: Value of write = 0
[86753.863266] write_proc_unbounded: Value of write = 0
[86753.863276] write_proc_2mb_limit: Value of write = 0
[86753.863290] write_proc_unbounded: Value of write = 0
[86753.863299] write_proc_2mb_limit: Value of write = 0
[86753.864269] write_proc_unbounded: Value of write = 0
[86753.864276] write_proc_2mb_limit: Value of write = 0
[86753.865175] write_proc_unbounded: Value of write = 0
[86753.865179] write_proc_2mb_limit: Value of write = 0
[86753.867058] write_proc_unbounded: Value of write = 0
[86753.867063] write_proc_2mb_limit: Value of write = 0
[86753.867582] write_proc_unbounded: Value of write = 0
[86753.867587] write_proc_2mb_limit: Value of write = 0
[86753.868170] write_proc_unbounded: Value of write = 0
[86753.868176] write_proc_2mb_limit: Value of write = 0
[86753.870015] write_proc_unbounded: Value of write = 0
[86753.870020] write_proc_2mb_limit: Value of write = 0
[86753.870775] write_proc_unbounded: Value of write = 0
[86753.870781] write_proc_2mb_limit: Value of write = 0
[86753.871382] write_proc_unbounded: Value of write = 0
[86753.871388] write_proc_2mb_limit: Value of write = 0
[86753.871451] write_proc_unbounded: Value of write = 0
[86753.871457] write_proc_2mb_limit: Value of write = 0
[86753.872265] write_proc_unbounded: Value of write = 0
[86753.872319] write_proc_2mb_limit: Value of write = 0
[86753.873583] write_proc_unbounded: Value of write = 0
[86753.873625] write_proc_2mb_limit: Value of write = 0
[86753.873818] write_proc_unbounded: Value of write = 0
[86753.873863] write_proc_2mb_limit: Value of write = 0
[86753.874526] write_proc_unbounded: Value of write = 0
[86753.874566] write_proc_2mb_limit: Value of write = 0
[86753.874793] write_proc_unbounded: Value of write = 0
[86753.874858] write_proc_2mb_limit: Value of write = 0
[86753.875195] write_proc_unbounded: Value of write = 0
[86753.875241] write_proc_2mb_limit: Value of write = 0
[86753.878525] write_proc_unbounded: Value of write = 0
[86753.878585] write_proc_2mb_limit: Value of write = 0
[86860.398080] INFO: NMI handler (ghes_notify_nmi) took too long to run: 1.083 msecs
[86957.642229] write_proc_unbounded: Value of write = 0
[86957.642242] write_proc_2mb_limit: Value of write = 0
[86957.759412] write_proc_unbounded: Value of write = 0
[86957.759427] write_proc_2mb_limit: Value of write = 0